export function getPageKeywords(pathname?: string) {
  const map: { [p: string]: string } = {
    '/features/customer-acquisition':
      '句子互动,句子秒回,SCRM, 通讯软件管家,批量加好友,自动加好友,聚合聊天,自动回复,自动群发,私域运营, 私域工具,私域流量精细化运营,流量运营,手机号加好友,Excel 加好友,AI 外呼',
    '/features/sop':
      '句子互动,句子秒回,SCRM,通讯软件管家,批量加好友,自动加好友,聚合聊天,SOP触达,私域运营, 私域工具,私域流量精细化运营,流量运营,SOP运营,生命周期管理,自动回复,自动拉群',
    '/features/contact-platform':
      '句子互动,句子秒回,SCRM,通讯软件管家,聚合聊天,批量加好友,自动加好友,聚合聊天,SOP触达,私域运营, 私域工具,私域流量精细化运营,流量运营,侧边栏,数据打通',
    '/features/data-center':
      '句子互动,句子秒回,SCRM,通讯软件管家,批量加好友,自动加好友,聚合聊天,SOP触达,私域运营, 私域工具,私域流量精细化运营,流量运营,数据打通,绩效统计,消息存档,消息导出',
    '/features/management':
      '句子互动,句子秒回,SCRM,通讯软件管家,批量加好友,自动加好友,聚合聊天,SOP触达,私域运营, 私域工具,私域流量精细化运营,流量运营,绩效统计',
    '/features/security':
      '句子互动,句子秒回,SCRM,通讯软件管家,数据保护,数据安全,私有化部署,安全合规,私域运营, 私域工具,私域流量精细化运营,流量运营,私域风控',
    '/solutions/general':
      '句子互动,句子秒回,SCRM, 通讯软件管家,批量加好友,自动加好友,SOP触达,excel加好友,AI外呼, RPA,聚合聊天,自动触达,定时推送,自动回复,自动群发,私域运营, 私域工具,私域流量精细化运营,流量运营',
    '/solutions/customer-service':
      '句子互动,句子秒回,SCRM, 通讯软件管家,批量加好友,自动加好友,SOP触达,excel加好友,AI外呼, RPA,聚合聊天,自动触达,定时推送,自动回复,自动群发,私域运营, 私域工具,私域流量精细化运营,流量运营,绩效统计',
    '/solutions/increase':
      '句子互动,句子秒回,SCRM, 通讯软件管家,批量加好友,自动加好友,SOP触达,excel加好友,AI外呼, RPA,聚合聊天,自动触达,定时推送,自动回复,自动群发,私域运营, 私域工具,私域流量精细化运营,流量运营',
    '/solutions/operate':
      '句子互动,句子秒回,SCRM, 通讯软件管家,批量加好友,自动加好友,SOP触达,excel加好友,AI外呼, RPA,聚合聊天,自动触达,定时推送,自动回复,自动群发,私域运营, 私域工具,私域流量精细化运营,流量运营',
    '/solutions/consumer-goods':
      '句子互动,句子秒回,SCRM, 通讯软件管家,批量加好友,自动加好友,SOP触达,excel加好友,AI外呼, RPA,聚合聊天,自动触达,定时推送,自动回复,自动群发,私域运营, 私域工具,私域流量精细化运营,流量运营,消费品,新零售',
    '/solutions/education':
      '句子互动,句子秒回,SCRM, 通讯软件管家,批量加好友,自动加好友,SOP触达,excel加好友,AI外呼,聚合聊天,自动触达,定时推送,自动回复,自动群发,私域运营, 私域工具,私域流量精细化运营,K12,成人教育,成人培训,素质教育',
    '/solutions/health':
      '句子互动,句子秒回,SCRM, 通讯软件管家,批量加好友,自动加好友,SOP触达,excel加好友,AI外呼, RPA,聚合聊天,自动触达,定时推送,自动回复,自动群发,私域运营, 私域工具,私域流量精细化运营,流量运营,医疗',
    '/solutions/finance':
      '句子互动,句子秒回,SCRM, 通讯软件管家,批量加好友,自动加好友,SOP触达,excel加好友,AI外呼, RPA,聚合聊天,自动触达,定时推送,自动回复,自动群发,私域运营, 私域工具,私域流量精细化运营,流量运营,银行,证券,基金',
    '/cases':
      '句子互动,句子秒回,SCRM,通讯软件管家,私域运营, 私域工具,私域流量,客户管理精细化运营,客户运营,流量运营, 批量加好友,自动加好友,自动回复,自动群发,SOP触达,消费品,新零售,教育,医疗,金融,互联网服务,政务服务',
    '/about-us': '句子互动、营销服务、IM平台、即时通讯、RPA、智能对话、私域运营、AI、人工智能、ChatGPT、AI知识库、AGI、GPT、NLP、多模态、自然语言、Y Combinator、百度 AI 加速器、Plug and Play、技术服务商、对话式营销、会话服务、硅谷孵化器',
    '/culture': '句子互动、对话式营销、IM平台、即时通讯、RPA、智能对话、私域运营AI、人工智能、ChatGPT 、AI知识库、AGI、GPT、NLP、多模态、自然语言',
    '/': 'AI模型、人工智能、大模型、ChatGPT、AIGC、企业知识库、AI、AI聊天、知识管理、Open AI、生成式AI，AI知识库、多模态、RPA、SCRM、私域客服、句子互动、通讯软件管家、私域运营、客户运营、批量加好友、自动回复、SOP触达、私域运营、对话式营销云、IM跨平台',
    'features/ai': 'AI模型、大模型开放平台、人工智能、大模型、ChatGPT、AIGC、人工智能、企业知识库、AI、生成式、大模型产品体系、大模型训练调优平台、AI聊天、chat、gpt4、gpt-4、知识管理、Open AI、垂直化AI、知识库，生成式AI，AI知识库、SCRM、私域客服、句子互动、句子秒回、通讯软件管家、私域运营',
    'features/rpa': 'RPA、SCRM、私域客服、句子互动、通讯软件管家、私域运营、私域工具、私域流量、客户管理、精细化运营、客户运营、自动加好友、自动回复、SOP触达、聚合聊天、对话式营销云、IM跨平台、AI模型、大模型开放平台、人工智能、大模型、ChatGPT、AIGC、企业知识库',
    'features/government': '句子互动、 5G 消息、消息触达、数智化转型、数据保护、消费品行业、互联网行业、政务行业、RPA、SCRM、私域客服、句子互动、通讯软件管家、私域运营、私域工具、私域流量、客户管理、AI模型、大模型开放平台、人工智能、大模型、ChatGPT、AIGC、人工智能、企业知识库、AI',
    'features/internet': 'ChatGPT、人工智能、企业管理、知识管理、RPA、AI客服、人机协作、IM跨平台、SCRM、私域客服、句子互动、通讯软件管家、私域运营、私域工具、私域流量、客户管理、精细化运营、批量加好友、自动回复、SOP触达、聚合聊天、消费品行业、互联网行业、AI模型、人工智能、ChatGPT、AIGC、AI',
    'features/customer': 'ChatGPT、人工智能、企业管理、知识管理、RPA、AI客服、人机协作、IM跨平台、SCRM、私域客服、句子互动、通讯软件管家、私域运营、私域工具、私域流量、客户管理、精细化运营、批量加好友、自动回复、SOP触达、聚合聊天、消费品行业、互联网行业、AI模型、人工智能、ChatGPT、AIGC、AI',
    'features/case': 'ChatGPT、人工智能、企业管理、知识管理、RPA、AI客服、人机协作、IM跨平台、SCRM、私域客服、句子互动、通讯软件管家、私域运营、私域工具、私域流量、客户管理、精细化运营、批量加好友、聚合聊天、消费品行业、互联网行业、人工智能、ChatGPT、AIGC、AI、德伦口腔、九十里',
  };
  if (!pathname) {
    return map['/'];
  }
  let key =
    Object.keys(map)
      .sort((a, b) => b.length - a.length)
      .find((k) => pathname.includes(k)) || '/';
  return map[key];
}

export function getPageDescription(pathname?: string) {
  const map: { [p: string]: string } = {
    '/features/customer-acquisition':
      '句子互动提供规模化获客解决方案，零人工成本把沉默的存量线索规模化迁移成可双向互动、多维触达的社交关系链。为用户打造行动成本最低的转化路径、为企业实现高转化率的私域构建，全程自动化完成，同时提供更安全的风控策略。',
    '/features/sop':
      '句子互动提供私域SOP消息触达解决方案，一次性完成客户全生命周期的运营规划，在任意时间、任意场景下执行触达转化。依托 RPA 技术，句子互动将 IM 软件变成可自动执行计划任务的机器人，让营销实现真正意义上的 SOP 化。',
    '/features/contact-platform':
      '句子互动提供搭建客户会话中台解决方案，聚合多种 IM 平台消息的能力，在一个后台应答来自多平台多个账号上的消息，亦可以同时主动触达这些客户，无论他们来自微信、抖音、5G 短信、WhatsApp 还是邮件。',
    '/features/data-center':
      '句子互动提供搭建数据管理中心解决方案，把全域数据汇总在数据管理中心，呈现从增长到留存、从活跃到转化的一切业务数据和人效数据统计，为管理者提供更科学的业务流程优化策略和团队管理决策依据。',
    '/features/management':
      '句子互动提供多维度、多分级的权限管理，无论是企业内部各级消息的传达、权限的赋予，还是运营过程中消息的高效分配回复，亦或是运营后对员工的绩效管理。',
    '/features/security':
      '句子互动为企业提供数据保护技术措施、数据保护管理组织措施、信息安全事件的响应、第三方支持等解决方案。',
    '/solutions/general':
      '句子互动提供私域全链路解决方案，让私域业务成为可被标准化落地执行、真能为企业带来转化的数据资产，助力企业 10 倍提高私域流量的运营效率。',
    '/solutions/customer-service':
      '句子互动提供把任意 IM 软件变成效率客服系统的解决方案，在一个后台应答来自多平台多个账号上的消息。同时打破账号间好友关系隔阂，让会话在员工之间高效流转。',
    '/solutions/increase':
      '句子互动提供增长场景解决方案，打造新流量时代的增长引擎，句子互动提供多种方式零人工成本规模触达并添加用户进入私域，助力冷启动流量池搭建。',
    '/solutions/operate':
      '句子互动将 IM 软件变成可自动执行计划任务的机器人，解决面向数百万用户的规模化、千人千面营销推送难题。',
    '/solutions/consumer-goods':
      '句子互动助力消费品行业快速搭建私域流量池，赋能更多 SKU 展现机会、打通结果数据构建增长到转化的私域业务闭环。',
    '/solutions/education':
      '句子互动助力教培行业高效激活用户，将长转化周期下的复杂运营动作更标准化、完美的被执行落地，完成线索的转化。',
    '/solutions/health':
      '句子互动助力医疗健康行业为用户提供更高效、更专业、更安全的健康服务。',
    '/solutions/finance':
      '句子互动保障用户数据安全，集成已有数据系统，多层级权限管理让每一次服务更专业、更有温度。',
    '/cases':
      '各个行业、各种规模的团队都在使用句子互动。我们助力企业和组织建立以社交关系为核心的营销体系，高效触达与深度连接数以千万计的客户，让营销事半功倍。',
    '/about-us': '句子互动成立于 2017 年，是国内的领先的对话式营销云技术服务商。集成国内外主流 IM 平台，为企业与开发者提供基于即时通信软件的规模化营销服务。句子互动团队在 RPA、智能对话与私域运营服务领域不断创新，每日提升 1000 万人次的会话服务体验。团队累计融资数千万，投资机构包括 Plug and Play、PreAngel、 Y Combinator、TSVC、阿尔法公社、真成投资等。团队既是硅谷著名孵化器 Y Combinator 国内首批入围团队，也是 Facebook 中国大陆首期加速器、百度 AI 加速器首期成员，目前团队已经过百人。',
    '/culture': '句子互动与优秀的人一起打造私域新生态。',
    '/': '句子互动致力于打造由大模型驱动的下一代对话式营销云，通过 AI+RPA 技术，句子互动可以打通即时通讯软件、飞书、5G 消息、WhatsApp 等不同的 IM，是国内第一家将大模型落地于营销场景的公司。基于企业数据，句子互动可以为企业训练专属领域的知识库，并对接到不同 IM 里。聚焦解决营销场景上的问题，如售前转化、IP 塑造、销售转化、售后转化、提高客服效率等。句子互动也是全球最大的对话式 RPA 开源框架 Wechaty 的商业化公司。',
    'features/ai': '通过句子系统导入客服聊天记录或手动上传数据，可以打造企业专属GPT。相比通用的ChatGPT，基于专属GPT可造的大模型，能够结合企业的产品和业务知识进行对话服务。数据处理过程无需人工标注，支持人工干预，可确保送达给用户的信息是企业可控的。Al客服包括AI全自动、人机协作两种模式。Al全自动模式，直接由AI机器人对用户问题进行回复；人机协作模式，人工在聊天框点击AI按钮，Al会在知识库进行匹配，推荐合适的话术，辅助人工客服作业。',
    'features/rpa': '句子互动SCRM，是下一代营销云。句子基于RPA技术，将各个IM的消息收发、客户管理等操作路径封装，员工在可视化页面下更高效的完成面向数百万用户的消息推送和应答服务。通过即时通讯软件运营沉淀私域流量，提供工具和咨询服务，从引流获客、规模化运营、客户管理到转化变现的全生命周期，助力企业实现精细化运营管理，十倍提高运营效率。',
    'features/government': '面向大组织的对话式营销云，助力互联网时代党政军、央国企等大型组织建立以社交关系为核心（如 5G 消息、飞书、钉钉等）为核心的营销体系，高效触达与深度连接数以千万计的老百姓和终端用户，让消息触达和营销事半功倍。全力助力大型组织实现高效的数智化转型。',
    'features/internet': '句子互动主要围绕互联网产品为用户制定标准化的产品方案和定制化的私域解决方案。根据互联网行业特点和大量沉淀的实践方法论制定通用案例、根据互联网企业的营销痛点定制方案。高效触达与深度连接数以千万计的客户，让营销事半功倍。',
    'features/customer': '句子互动主要围绕消费品为用户制定标准化的消费品方案和定制化的私域解决方案。根据消费品行业特点和大量沉淀的实践方法论制定通用案例、根据消费品企业的营销痛点定制方案。高效触达与深度连接数以千万计的客户，让营销事半功倍。',
    'features/case': '句子互动是一家人工智能技术与服务提供商，主要提供基于社交生态的智能机器人营销云系统。句子互动的主营业务包括销售、市场和售后，通过智能对话、客服系统和数据分析帮助企业快速获客、增加用户粘性并提高转化。句子互动的产品和服务涵盖了多个场景，包括微信、WhatsApp等社交平台，以及教育、消费品、金融保险、政务服务等领域。服务了德伦口腔、九十里等客户。',
  };
  if (!pathname) {
    return map['/'];
  }
  let key =
    Object.keys(map)
      .sort((a, b) => b.length - a.length)
      .find((k) => pathname.includes(k)) || '/';
  return map[key];
}
